{
    "PAR-T-LBD-01": {
        "item_name": "Club Key",
        "essential": true,
        "description": "A sturdy brass key with a rounded head shaped like a clover-like club symbol, its edges worn smooth from years of handling. The metal has a comforting weight to it, and faint tarnish lines trace the grooves of the simple, elegant design.",
        "addDescription": "You picked up the club key.",
        "useDescription": "You used the key"
    },
    "PLB-T-LBD-02": {
        "item_name": "Diamond Key",
        "essential": true,
        "description": "A polished brass key with a diamond-shaped head, its clean angles catching light in sharp reflections. The face of the diamond is slightly raised, as though the design was stamped with deliberate care, giving the key a refined, almost regal presence.",
        "addDescription": "You picked up the diamond key.",
        "useDescription": "You used the key"
    },
    "SFE-T-LBD-01": {
        "item_name": "Spade Key",
        "essential": true,
        "description": "A long brass key with a pointed spade-shaped head, the narrow tip giving it a sharp, almost ceremonial look. The engraving is crisp despite the key's age, and the darkened metal suggests it once held particular importance.",
        "addDescription": "You picked up the spade key.",
        "useDescription": "You used the key"
    },
    "PAR-N-001-02": {
        "item_name": "Torn Diary Entry",
        "essential": true,
        "description": "Dated: March 3, 1995\n\n\n\nI heard the sirens again today.\n\nHarold dismisses it as 'routine checks,' but he forgets I grew up around the mines. I know the sound of panic when I hear it. The men look tired... leaner every week, like they're working double shifts. Maybe they are. Harold never talks about the mine anymore. Every attempt I make leads to an argument.\n\nI don't know what he's hiding, but whatever it is... it's getting worse.\n\nHe used to be a kinder man.\n\n\n\nI pray he finds his way back.",
        "addDescription": "You picked up the note.",
        "useDescription": "You cannot use this item."
    },
    "RAT-N-002-01": {
        "item_name": "Internal Corporate Memo",
        "essential": true,
        "description": "Scarlet Mining Co. --- Internal Correspondence                                   To: All Supervisors                                                              Date: July 18, 1995                                                              Subject: Productivity Quotas\n\nEffective immediately, daily extraction quotas will increase across Sectors 2-6.\n\nWorkers expressing 'concerns' about fatigue or safety procedures are to be documented and reassigned as needed.\n\nAdditionally, due to a labor shortage, temporary hires will be permitted in non-hazardous auxiliary roles regardless of age or prior experience. This classification is non-negotiable and should not be discussed outside company property.\n\nReport all disruptions to Office 4C.\n\n-H.S.",
        "addDescription": "With the rat gone, you reach down and pick up the note.",
        "useDescription": "You cannot use this item."
    },
    "LIV-N-003-01": {
        "item_name": "Newspaper Clipping",
        "essential": true,
        "description": "THIRTEEN DEAD IN MINE COLLAPSE --- COMPANY CALLS IT 'UNFORESEEABLE'              Rockford County Herald --- August 22, 1995\n\nA partial collapse in the Scarlet Mining Co. shaft system left thirteen confirmed dead, including multiple 'auxiliary assistants,' a term the company declined to clarify.\n\nRepresentatives denied allegations of unsafe conditions and insisted the collapse was caused by an 'unpredictable geological shift.'\n\nGrieving families gathered outside the mine entrance demanding answers. Some claim the company is withholding information about the cause.\n\nScarlet Mining Co. has promised a full investigation.\n\nNo timeline has been provided.",
        "addDescription": "You picked up the newspaper.",
        "useDescription": "You cannot use this item."
    },
    "BTH-N-004-01": {
        "item_name": "Personal Letter",
        "essential": true,
        "description": "My dear Clara,\n\n\n\nI don't know whom to turn to anymore.\n\nThe men from the mine---those poor boys---haunt my sleep. Harold says I should stop 'meddling,' but how can I be silent when I know? When I've seen their faces? When I've heard what they make the children do?\n\nVivian left not long after the collapse. She said she couldn't bear to stay in this house another day... said the walls felt built on suffering, and she would not be part of whatever Harold was trying to hide. I wanted to go with her, but she insisted I stay, said someone needed to stand up to him. I fear she saw a darkness in him that even I refused to acknowledge.\n\nIf the truth comes out, the Scarlet name will be ruined forever. Maybe it should be.\n\nTonight I'm going to speak with him again. I'm frightened, but this has gone on too long. He must understand that this cannot continue. I pray he listens.\n\nIf he doesn't... I don't know what comes next.\n\n\n\n-Eleanor",
        "addDescription": "You take the note from the base of the ring stand.",
        "useDescription": "You cannot use this item."
    },
    "ATC-N-005-01": {
        "item_name": "Email Printout",
        "essential": true,
        "description": "Email Dated: September 9, 1995                                                   Subject: Regarding the Investigation\n\n\n\nHarold,\n\n\n\nThe board has agreed to support your request for a private geological report. If the external review indicates structural negligence, we will not be able to suppress it. You understand what that means.\n\nI strongly advise maintaining a firm, consistent narrative about the 'unforeseeable' cause. Any suggestion of overworking, underage labor, or unreported safety failures will expose the company to enormous liability.\n\nIf Eleanor continues contacting families, you must ensure she does not complicate matters further. Her involvement is... unwise.\n\nWe need stability right now.\n\n\n\n-Fletcher Ward, Esq.                                                             Scarlet Mining Co. Legal Counsel",
        "addDescription": "You picked up note.",
        "useDescription": "You cannot use this item."
    },
    "SFE-N-006-02": {
        "item_name": "Journal Page",
        "essential": true,
        "description": "Dated: October 2, 1995\n\n\n\nShe wouldn't stop.\n\nShe wouldn't stop.\n\nI told her the mine would survive if she just kept quiet. That it was almost fixed. That we could rebuild.\n\n\n\nBut she called me a murderer.\n\n\n\nSaid the children were on my hands.\n\nSaid she would go to the press.\n\nSaid she didn't care what happened to us.\n\nShe forced my hand.\n\n\n\nI loved her. God help me.\n\n\n\nThere's no going back now.",
        "addDescription": "You picked up the note.",
        "useDescription": "You cannot use this item."
    },
    "FRD-T-XXX-01": {
        "item_name": "Yogurt Cup",
        "essential": false,
        "description": "A small cup of vanilla greek yogurt with the label on top, 'Best if used by March 3, 2013.'",
        "addDescription": "You take the yogurt cup from the fridge.",
        "useDescription": "You cannot use this item."
    },
    "FRD-T-XXX-02": {
        "item_name": "Grape Jelly",
        "essential": false,
        "description": "A jar of grape jelly with a faded label and slightly sticky lid. It's still sealed, and still fresh.",
        "addDescription": "You take the jar of jelly from the fridge.",
        "useDescription": "You spread the jelly over the bread."
    },
    "PAN-T-XXX-01": {
        "item_name": "Mac and Cheese",
        "essential": false,
        "description": "An unopened box of macaroni and cheese, its cardboard a bit worn with age.",
        "addDescription": "You take a box of mac and cheese from the shelf.",
        "useDescription": "You cannot use this item."
    },
    "PAN-T-XXX-02": {
        "item_name": "Peanut Butter",
        "essential": false,
        "description": "A jar of peanut butter, smooth and unopened, the lid coated in a thin layer of dust.",
        "addDescription": "You take the jar of peanut butter from the shelf.",
        "useDescription": "You spread the peanut butter over the bread."
    },
    "PAN-T-XXX-03": {
        "item_name": "Loaf of Bread",
        "essential": false,
        "description": "A simple loaf of bread sealed in plastic, a bit firm but still perfectly usable.",
        "addDescription": "You take the loaf of bread from the shelf.",
        "useDescription": "You make a peanut butter and jelly sandwich."
    },
    "XXX-T-RAT-01": {
        "item_name": "Peanut Buter and Jelly Sandwich",
        "essential": false,
        "description": "A neatly made peanut butter and jelly sandwich... the bread soft, the peanut butter smooth, and the grape jelly giving off a faint, sweet scent.",
        "addDescription": "You carefully spread the peanut butter and grape jelly onto the slices of bread and press them together, forming a simple but satisfying peanut butter and jelly sandwich.",
        "useDescription": "You make a peanut butter and jelly sandwich."
    },
    "UTC-T-PTB-01": {
        "item_name": "Pristine Trowel",
        "essential": true,
        "description": "An ornate little gardening trowel with a smooth, carved wooden handle and a sharp metal scoop that gleams despite its surroundings. For an object left in an abandoned greenhouse, it appears remarkably well-kept... sharp, polished, and pristine, as though someone took great care to preserve it. An echo of a voice in your head urges you to use it, as if the world will end if you don't.",
        "addDescription": "You take the trowel from the table. It would be rather difficult to dig without it.",
        "useDescription": "You slay the dirt."
    },
    "SPR-T-MEZ-01": {
        "item_name": "Wooden Broom",
        "essential": false,
        "description": "A simple wooden broom, could be useful for reaching something high-up.",
        "addDescription": "You picked up the wooden broom.",
        "useDescription": "You poke the attic door with the broom and the ladder falls in front of your feet."
    },
    "KID-T-XXX-01": {
        "item_name": "Photo",
        "essential": false,
        "description": "You examine the photograph, its edges softened and slightly curled with age. Three people stand beneath the bright summer sun... an older man with a calm, steady smile, a woman beside him whose warm expression softens her entire face, and a younger woman in front who looks unmistakably like your mother in her teenage years. The three of them stand close together, relaxed and genuinely happy. Turning the photo over, you find a handwritten note on the back: 'Vivian's 17th birthday - July 21, 1994.'",
        "addDescription": "You picked up the photo.",
        "useDescription": "You cannot use this item."
    },
    "KDC-T-XXX-01": {
        "item_name": "Old Doll",
        "essential": false,
        "description": "A delicate porcelain doll with finely painted features and an old-fashioned dress; despite its age, its glassy eyes seem to follow you.",
        "addDescription": "You picked up the doll and noticed a small silver ring where the doll was sat.",
        "useDescription": "You cannot use this item, you freak."
    },
    "KDC-T-BTH-02": {
        "item_name": "Silver Ring",
        "essential": false,
        "description": "A polished silver ring with an engraving along the inner band that reads, 'Never gonna give you up, never gonna let you down.'",
        "addDescription": "You picked up the ring.",
        "useDescription": "You place the ring on the ring stand."
    }
}