{
    "exterior": {
        "room_code": "EXT",
        "description": "You take in the looming shape of the manor, its silhouette swallowing the last of the fading light, but the longer you stand there, the more the cold rain begins to seep through your clothes. A shiver coils down your spine as the wind cuts across the drive, urging you forward.\n\nWhatever waits inside can come later... for now, the front porch is the only shelter in sight.",
        "returnDesc": "you're back in the exterior.",
        "choices": {
            "1": {
                "Find Shelter on the Front Porch": "porch",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "porch": {
        "room_code": "POR",
        "description": "The porch groans beneath your weight as you step onto it, the boards swollen and soft from years of damp, each footfall sinking slightly as though the house is testing your presence. The railing is a lacework of peeling paint and rusted nails; its ornate Victorian patterns warped into twisted shapes by time. Up close, the double front doors dominate your vision... tall, heavy slabs of dark wood stained a deep crimson that seems darker in the shadows, almost as if the color had seeped into the grain rather than been painted on. The brass handles are cold beneath a thin film of grime, each one marked by deep gouges, as though someone once clawed at the door in desperation or fury.\n\nOff to your left, partly veiled by a heavy curtain of ivy; a single tall window watches the porch. The glass is clouded with age, its reflection warped, yet you can faintly make out shapes and shadows shifting in the darkness beyond, their edges too soft and distant to understand from here. The wind stirs just enough to rattle a loose porch board behind you, though the rest of the air remains unnervingly still. Ahead, the red doors stand silent and waiting.",
        "returnDesc": "you're back in the porch.",
        "choices": {
            "1": {
                "Enter Scarlet Manor": "foyer",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Investigate the window": "You brush aside a curtain of ivy clinging to the window frame, its brittle leaves crackling as you lean closer. The glass is fogged with age, streaked with dust and darker residue around the edges, but you manage to clear a small smear to peer through. The room beyond is dim and crowded, its walls lined with tall, shadow-soaked shapes that rise almost to the ceiling, and the floor is scattered with fallen objects that catch faint slivers of moonlight... papers, perhaps, or old bindings split from time. A large portrait hangs crooked on the far wall, its features swallowed by darkness, and something about the dense, orderly rows and the cluttered floor makes the space feel heavy, suffocating, meticulously filled. As your eyes adjust, it becomes clear this must be a library... one long neglected. Then the glass thuds softly under your fingertips, as though something inside brushed against it. Your breath fogs the pane, erasing the view, while the ivy beside you rustles once more despite the perfectly still air.",
                "once": true,
                "nav" : false,
                "item": false
            },
            "3": {
                "Turn back": "You glance over your shoulder, back toward the drive where your car waits at the edge of the fog. For a moment, the thought of slipping behind the wheel and leaving this place behind is painfully tempting... just a turn of the key and you could be gone before the house even notices. But the cold air settles heavily around you, and something about the manor's dark silhouette keeps its grip on your attention. You steady your breath, push down the rising urge to flee, and force yourself to turn back toward the house. Whatever waits inside, running won't solve it now. ",
                "once": true,
                "nav" : false,
                "item": false
            }
        }
    },
    "foyer": {
        "room_code": "FOY",
        "description": "You grip the cold brass handle, feeling the deep scratches beneath your fingertips as you pull. The heavy door resists at first, then yields with a long, low groan, releasing a draft of stale, ancient air that spills out around you. As the darkness inside parts just enough to reveal the foyer beyond, you step over the threshold and let the house swallow the sound of the rain behind you.\n\nThe foyer swallows you in cold air the moment you step inside, the scent of dust and old varnish thick enough to taste. Your eyes adjust slowly, shapes taking form in the dim natural light that sneaks past the threshold behind you. The ceiling rises far higher than you expected... an immense, vaulted chamber crowned by a magnificent chandelier suspended low over the open floor. Its iron frame is a sprawling tangle of ornate scrollwork and curved arms, each one fitted with tall, unlit candles. Even in darkness, it radiates a kind of commanding presence, like a relic meant to be adored from below.\n\nYour gaze drifts outward. Twin staircases spiral upward from the left and right sides of the room, their carved banisters mirroring each other perfectly as they curve toward a mezzanine that spans the foyer like a suspended bridge. Straight ahead, beneath that mezzanine, a long hallway stretches into the depths of the house... narrow, dark, lined with doors that seem to lean subtly inward, as though listening. To your immediate right, an open doorway reveals the edge of a parlor draped in heavy curtains, faint shapes of furniture lurking inside. To your left, a large door stands firmly shut... tall and imposing.\n\nYou barely manage a breath before the front door behind you slams shut with violent force, the sound cracking through the chamber like a gunshot. A sharp metallic click follows... locked. In that same heartbeat, the chandelier above erupts to life as every candle ignites at once in a sudden burst of flame. Warm light floods the foyer as sconces along the walls flare open, revealing the house's full grandeur... and the hollow stillness beneath it. Whatever is here, it's not letting you leave anytime soon.",
        "returnDesc": "The foyer greets you with its warm candlelight and towering symmetry, the chandelier still burning steadily overhead. The grand staircases and shadowed hallway seem no less imposing now that you've stood here before.",
        "choices": {
            "1": {
                "Approach the door to the left": "library_door",
                "once": false,
                "nav" : true,
                "item": false
            }, 
            "2": {
                "Investigate the room to the right": "parlor",
                "once": false,
                "nav" : true,
                "item": false
            },
            "3": {
                "Continue straight into the corridor": "hallway",
                "once": false,
                "nav" : true,
                "item": false
            }, 
            "4": {
                "Go up the stairs to the second floor": "mezzanine",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "parlor": {
        "room_code": "PAR",
        "description": "Stepping through the open doorway, you find yourself in a parlor frozen somewhere between elegance and decay. The air is stale, carrying the faint scent of old perfume and dust. A round table commands the center of the room, draped in a faded lace runner and surrounded by mismatched chairs with sunken cushions. On its surface rests a torn page---ripped cleanly from a larger book or diary---with a brass key topped with a rounded, clover-shaped club symbol placed neatly on top, catching the candlelight in a muted glint. Heavy curtains frame tall windows while the warm glow of candles and wall sconces washes over the scattered furnishings: an ornate settee, a pair of armchairs, and a cracked side cabinet leaning slightly under its own weight. The open doorway behind you offers a clear view back into the foyer, reminding you how close you remain to where you first stepped inside.",
        "returnDesc": "The parlor looks much as it did before... the warm candlelight, the sagging furniture, and the round table at the center giving the room its quiet, faded charm. The open doorway still offers a clear view back into the foyer.",
        "choices": {
            "1": {
                "Go back to the foyer": "foyer",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Pick up the club key": "PAR-T-LBD-01",
                "once": true,
                "nav" : false,
                "item": true
            },
            "3": {
                "Pick up the note": "PAR-N-001-02",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "hallway": {
        "room_code": "HLW",
        "description": "Stepping beneath the mezzanine, you follow the foyer into a long central hallway. To your left, a large wooden sliding door dominates the wall, its handle worn smooth from years of use. To your right, an open doorway leads into what appears to be a dining room, faintly illuminated by the candlelight within.",
        "returnDesc": "The hallway looks much the same as before, with the large sliding door and the open dining room entrance still exactly where you remember them. The faint glow from the foyer lingers nearby, reminding you of the path you came from.",
        "choices": {
            "1": {
                "Open the door on the left": "living_room",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Investigate the dining room": "dining_room",
                "once": false,
                "nav" : true,
                "item": false
            },
            "3": {
                "Go back to the foyer": "foyer",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "living_room": {
        "room_code": "LIV",
        "description": "Sliding open the large wooden door, you find yourself stepping into a living room that feels both lived-in and long forgotten. A wide stone fireplace dominates the far wall, its mantle coated in a thin layer of dust, and a large portrait hangs above it... its softened features watching the room with an unreadable stillness. The candlelight washes warmly over the faded furniture: a sagging sofa with worn stitching, two armchairs whose cushions have long since lost their shape, and a low coffee table settled between them. On the table rests a yellowed newspaper clipping, its brittle edges curled and its ink faded from years of neglect, as though it has waited untouched for longer than anyone can easily guess.",
        "returnDesc": "The living room looks much as you left it; the dusty fireplace, the worn furniture, and the quiet stillness giving the space an unchanged, lingering heaviness.",
        "choices": {
            "1": {
                "Go back into the hallway": "hallway",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Examine the portrait": "The portrait above the fireplace shows a man standing proudly before the freshly carved mouth of a mine, the raw earth behind him marking the earliest days of what would become the Scarlet family legacy. He's dressed in a striking purple suit, its color still vivid despite the painting's age, and his rigid posture suggests a man certain of his own importance. A tarnished bronze nameplate fixed to the ornate frame reads: 'William A. Scarlet --- Scarlet Mine Grand Opening, 1866.' Something about that date lingers in your mind, as though it may matter more than it seems.",
                "once": false,
                "nav" : false,
                "item": false
            },
            "3": {
                "Pick up the newspaper": "LIV-N-003-01",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "dining_room": {
        "room_code": "DIN",
        "description": "Stepping into the dining room, you find a long, imposing table stretching down the center of the room, its surface mostly bare beneath a thin layer of dust. Only the head of the table shows signs of regular use... the chair pushed back slightly, its cushion worn in a way that suggests the same person sat there day after day. Just beside it, another place has been set with deliberate care, yet the untouched dust coating the plate and silverware reveals it hasn't been used in a very long time. The two settings---one lived-in, one frozen in remembrance---cast a quiet, uneasy weight across the room. As you take a step further inside, a sudden scurrying sound draws your eye... a small rat darts across the floor and disappears through a tiny hole in the far wall, vanishing into whatever room lies beyond. On that same wall, a simple wooden door waits slightly ajar, almost certainly leading toward the kitchen.",
        "returnDesc": "The dining room is just as still as before, the long table and dim candlelight giving the space the same quiet, heavy atmosphere.",
        "choices": {
            "1": {
                "Go through the door": "kitchen",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Go back out into the hallway": "hallway",
                "once": false,
                "nav" : true,
                "item": false
            }
        }        
    },
    "kitchen": {
        "room_code": "KIT",
        "description": "Stepping into the kitchen, you're met with the mix of worn tile floors and warm candlelight drifting in from the dining room. An old refrigerator stands against the far wall, its enamel chipped and humming faintly with age. A narrow door hangs slightly ajar, revealing the edge of a pantry beyond, while a heavier exterior door on the opposite wall leads out toward the greenhouse or garden, carrying a faint earthy scent through its cracks. In the center of the room sits a wooden island, and perched atop it is the same rat you saw in the dining room... now staring directly at you. With deliberate intention, it grabs a crumpled piece of paper from the countertop, hops down to the floor, and scurries toward a small hole at the base of the wall. Near the hole's entrance, the tile is smeared with faded streaks of peanut butter and jelly, a clear indication of the creature's favorite meal. Just before vanishing inside, the rat pauses, peeks out at you with the note still in its mouth, and slowly retreats, as if urging you to follow.",
        "returnDesc": "The kitchen feels much the same as before, the worn tiles and old refrigerator giving it a tired stillness. Near the wall, the rat's hole, and the faint smears of peanut butter and jelly remain just as you remember them.",
        "choices": {
            "1": {
                "Investigate the rat's hole": "rat_hole",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Open the fridge": "fridge",
                "once": false,
                "nav" : true,
                "item": false
            },
            "3": {
                "Investigate the pantry": "pantry",
                "once": false,
                "nav" : true,
                "item": false
            },
            "4": {
                "Go out to the greenhouse": "greenhouse",
                "once": false,
                "nav" : true,
                "item": false
            },
            "5": {
                "Go back to the dining room": "dining_room",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "rat_hole": {
        "room_code": "RAT",
        "description": "You crouch beside the small hole in the wall, but the rat is already deep within the shadows, the crumpled note well out of reach. The floor around the entrance is smeared with old peanut butter and jelly, stained into the tiles as if from countless tiny meals. You can't help but think 'if only there were some way to lure the rat back out.'",
        "returnDesc": "You crouch back down to the investigate rat's home.",
        "choices":{
            "1": {
                "Stand back up": "kitchen",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "fridge": {
        "room_code": "FRD",
        "description": "You pull open the refrigerator door, surprised when a faint chill washes over you... the old appliance still humming stubbornly after all these years. Inside, the shelves are nearly bare: several small cups of yogurt lined neatly along one side, and a single jar of grape jelly sitting alone on the top shelf, its label faded but recognizable.",
        "returnDesc": "The refrigerator hums softly as you open it again, its faint cool air drifting out just as before.",
        "choices":{
            "1": {
                "Close the fridge": "kitchen",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Take a yogurt cup": "FRD-T-XXX-01",
                "once": true,
                "nav" : false,
                "item": true
            },
            "3": {
                "Take the jelly": "FRD-T-XXX-02",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "pantry": {
        "room_code": "PAN",
        "description": "Stepping into the pantry, you're met with the stale, musty scent of old wood and decades of dust. The narrow shelves sag slightly under the weight of their forgotten contents, most of it long past its prime. Amid the clutter, a jar of peanut butter sits unopened beside a loaf of bread sealed in a plastic bag that's stiff with age. Stacked beside them---and crammed into nearly every remaining shelf---are countless boxes of macaroni and cheese, piled haphazardly as though someone once stocked them in bulk and never got the chance to go through it all.",
        "returnDesc": "The pantry feels just as you left it: dusty, cramped, and crowded with its forgotten shelves of old mac and cheese.",
        "choices": {
            "1": {
                "Go back into the kitchen": "kitchen",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Take a box of mac and cheese": "PAN-T-XXX-01",
                "once": true,
                "nav" : false,
                "item": true
            },
            "3": {
                "Take the peanut butter": "PAN-T-XXX-02",
                "once": true,
                "nav" : false,
                "item": true
            },
            "4": {
                "Take the loaf of bread": "PAN-T-XXX-03",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "greenhouse": {
        "room_code": "GHS",
        "description": "Stepping into the greenhouse, you're met with a heavy wave of warm, humid air... thick with the scent of damp soil and long-neglected plants. Grimy glass panes arch overhead, filtering the rain into soft, muted streaks of light that fall across several large planter boxes arranged throughout the room. Most of the vegetation has collapsed into brittle stems, leaving dark soil exposed in uneven mounds. In the corner, a crooked utility closet hangs half-open, its interior barely visible.\n\nAs you take another step, a sudden coolness slips across the back of your neck---unnatural in the greenhouse's heat---and the air stirs with a faint rustle of dead leaves. For a moment, you feel as though someone is passing behind you. Then a whisper drifts through the space, soft as breath against glass:\n\n'What's forgotten settles deep... where the oldest roots cling to memory.'\n\nThe sound fades, and the greenhouse returns to stillness... except for one detail you didn't notice before. In the central planter box, the soil forms a slightly raised, uneven patch, its surface subtly smoother than the rest, as though something had once been buried there... and recently covered again.",
        "returnDesc": "The greenhouse stands quiet and still, warm air heavy with the scent of damp soil while rain patters softly against the grimy glass panes above.",
        "choices": {
            "1": {
                "Search the utility closet": "utility_closet",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Go back into the kitchen": "kitchen",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "planter_box": {
        "room_code": "PLB",
        "description": "You press the pristine trowel into the raised patch of soil, its ornate handle fitting comfortably in your grip as the metal slips easily beneath the surface. The dirt parts with surprising softness, as though it's been disturbed not long ago. With a few careful scoops, the trowel strikes something solid... wood, faintly hollow-sounding under the blade. Brushing the soil aside, you reveal a small wooden box, its surface worn smooth and stained dark with age. The lid lifts with a reluctant creak, and inside, nestled against faded cloth, rests a brass key topped with a sharp, gleaming diamond-shaped head. As you loosen your grip on the trowel, it slips from your hand... yet before it touches the floor, it simply vanishes, leaving only the faint, uncanny sense, that it landed somewhere very... very far away.",
        "returnDesc": "",
        "choices": {
            "1": {
                "Take the diamond key": "PLB-T-LBD-02",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "utility_closet": {
        "room_code": "UTC",
        "description": "The interior of the closet is almost entirely bare. The air is stale and musty and the floor and walls are painted in a fine layer of dust. The only furniture of note is a plain wooden table. Perched on that table is a pristine trowel.\n\nThe trowel is your implement. You'll need it if you want to do this right.",
        "returnDesc": "The utility closet remains just as you left it... cluttered with rusted tools.",
        "choices": {
            "1": {
                "Return to the greenhouse": "greenhouse",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Take the trowel": "UTC-T-PTB-01",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "mezzanine": {
        "room_code": "MEZ",
        "description": "Walking up the stairs and stepping out onto the center of the mezzanine, you find yourself looking down over the grand foyer from a new vantage point. The chandelier hangs closer now, its many candles flickering in a delicate, wavering constellation above the open space below. From up here, the sweeping symmetry of the foyer is easier to appreciate... the twin staircases curling gracefully into one another, the tall portrait frames lining the walls, and the heavy front door sitting motionless beneath you. The long hallway stretches out behind you, running east to west with four closed doors set evenly along the northern wall, each one distinct in its own quiet way.\n\nThe left-most door is broad and sturdier than the others, its frame subtly more ornate... as if someone of importance once slept beyond it. The second door has a faint, lingering scent of dust and fabric drifting from its seams. The third door carries the slightest echo of tile beneath it, a coolness you can feel even from here. And the fourth door, though plain, seems to hum faintly with the restless stillness of a room that hasn't been opened in years.\n\nA glance upward reveals another detail: centered above the mezzanine ceiling is a closed drop-down attic ladder, its wooden frame tightly shut and far out of reach. The sight of it sends a mild shiver down the back of your neck... a reminder that, even here, the house has spaces not yet willing to meet you.",
        "returnDesc": "The mezzanine feels just as you left it, offering a clear view of the grand foyer below and the soft glow of the chandelier drifting upward in warm, steady light.",
        "choices": {
            "1": {
                "Go through door number 1": "master_bedroom",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Go through door number 2": "kids_room",
                "once": false,
                "nav" : true,
                "item": false
            },
            "3": {
                "Go through door number 3": "bathroom",
                "once": false,
                "nav" : true,
                "item": false
            },
            "4": {
                "Go through door number 4": "guest_room",
                "once": false,
                "nav" : true,
                "item": false
            },
            "5": {
                "Go down the stairs to the foyer": "foyer",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "bathroom": {
        "room_code": "BTH",
        "description": "Stepping through the door into a bathroom, you're met with the cool scent of tile and old porcelain, the candlelight reflecting off the glossy surfaces in soft, uneven patches. The room itself is tidy but long unused... dust clinging to the corners of the mirror and faint mineral stains shadowing the edges of the sink. On the countertop sits a peculiar ring stand shaped like an open hand, each of its five sculpted fingers meant to hold a ring. Four of them are adorned with tarnished bands, but the center finger stands bare, as though something important once rested there. The stand's base is unusually large and heavy, carved with faint decorative grooves, and it appears to conceal a small drawer... yet no latch, handle, or seam offers any hint on how it might be opened. The stillness of the room makes the absence of the missing ring feel strangely deliberate.",
        "returnDesc": "The bathroom is just as quiet as before, its cool tiles and faintly dusty fixtures reflecting the soft candlelight in muted patches.",
        "choices": {
            "1": {
                "Leave the bathroom": "mezzanine",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "ring_stand": {
        "room_code": "RNG",
        "description": "You slide the silver ring onto the bare finger of the porcelain ring stand, the metal settling neatly into place among the other tarnished bands. For a moment, nothing happens... then the stand gives a soft click, subtle but unmistakable. Its wide base shifts, and a hidden drawer springs open with a small metallic snap. Inside rests a folded note, tucked carefully into the narrow compartment. You lift the silver ring back off the stand before pocketing it once more.",
        "returnDesc": "You once again slide the silver ring onto the bare finger of the ring stand, and just as before ",
        "choices": {
            "1": {
                "Leave the bathroom": "mezzanine",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Take the note": "BTH-N-004-01",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "kids_room": {
        "room_code": "KID",
        "description": "Stepping through the door into a bedroom, you're met with a gentle hush, as though the room has been frozen in the moment it was last occupied. Faded floral wallpaper curls softly at the edges, and a small wooden desk sits beneath the window, still scattered with remnants of a life once lived here... an old journal with brittle pages, a dried fountain pen, and a cracked ceramic trinket that looks like it once held sentimental value. Beside the neatly made bed, a small table holds an unframed photograph, its edges worn from years of handling. Along one wall, a narrow bookshelf leans under the weight of well-loved novels and framed pictures capturing a younger woman in various candid moments: laughing with friends, posing in the manor's garden, and standing beside an older man whose expression is both proud and distant. The whole room feels paused mid-step, as though whoever lived here left quickly and never looked back.",
        "returnDesc": "The room is just as you left it... quiet, still, and filled with the lingering traces of life.",
        "choices": {
            "1": {
                "Open the closet door": "kids_closet",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Leave the bedroom": "mezzanine",
                "once": false,
                "nav" : true,
                "item": false
            },
            "3": {
                "Pick up the photo": "KID-T-XXX-01",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "kids_closet": {
        "room_code": "KDC",
        "description": "You pull open the closet door, and it resists at first... something inside shifting with a soft scrape before giving way. The space beyond is cramped and cluttered, piles of old belongings heaped in the center as though everything was hastily shoved inside in a single desperate moment. Boxes, folded blankets, brittle papers, and forgotten trinkets form an unstable mound that nearly reaches your waist. At the very top of it all sits a Victorian porcelain doll, its cracked face turned directly toward the door as if patiently waiting for someone to finally open it. The dim candlelight glints off its glassy eyes, making the stillness feel suddenly, unmistakably aware.",
        "returnDesc": "You open the doors to the closet again",
        "choices": {
            "1": {
                "Close the closet doors": "kids_room",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Take the doll": "KDC-T-XXX-01",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "guest_room": {
        "room_code": "GST",
        "description": "you walk into a guest bedroom filled with old junk including a long, wooden broom.",
        "returnDesc": "you are back in the guest bedroom",
        "choices": {
            "1": {
                "Leave the guest bedroom": "mezzanine",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Take the wooden broom": "GST-T-ATD-01",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "master_bedroom": {
        "room_code": "MBR",
        "description": "you are in the master bedroom",
        "returnDesc": "you are back in the master bedroom",
        "choices": {
            "1": {
                "Investigate the balcony": "balcony",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Investigate the closet": "master_closet",
                "once": false,
                "nav" : true,
                "item": false
            },
            "3": {
                "Open the safe": "nah fam that shit locked lmfao",
                "once": false,
                "nav" : false,
                "item": false
            },
            "4": {
                "Leave the master bedroom": "mezzanine",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "master_bathroom": {
        "room_code": "MBA",
        "description": "you walk into the master bedroom's private bathroom",
        "returnDesc": "you are back in the master bathroom",
        "choices": {
            "1": {
                "Leave the bathroom": "master_bedroom",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "balcony": {
        "room_code": "BAL",
        "description": "you walk out onto the balcony",
        "returnDesc": "you return to the balcony",
        "choices": {
            "1": {
                "Look longingly out into the distance": "you look out towards the moon and take a deep breath before remembering you got shit to do",
                "once": true,
                "nav" : false,
                "item": false
            },
            "2": {
                "Go back inside": "master_bedroom",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "attic": {
        "room_code": "ATC",
        "description": "u in da adic",
        "returnDesc": "u bak in da adic",
        "choices": {
            "1": {
                "Go back down the ladder onto the mezzanine": "mezzanine",
                "once": false,
                "nav" : true,
                "item": false
            }
        }

    },
    "library_door": {
        "room_code": "LBD",
        "description": "You move toward the tall, imposing door that stands shut along the foyer wall, its presence far heavier than you first realized. Up close, the wood reveals itself to be thick and tightly grained, reinforced with iron bands that run across its surface like ribs. Heavy chains have been drawn over the door in a tight lattice, secured by three distinct brass padlocks, each shaped like a card suit... one a pointed spade, another a rounded club, and the last a sharp-edged diamond. The locks hang motionless in the candlelight, giving the unmistakable impression that whatever lies beyond this door was meant to remain sealed.",
        "returnDesc" : "The tall, imposing door stands just as before, its heavy frame looming silently along the foyer wall.",
        "choices": {
            "1": {
                "Turn back into the foyer" : "foyer",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    }
}