{
    "exterior": {
        "room_code": "EXT",
        "description": "You take in the looming shape of the manor, its silhouette swallowing the last of the fading light, but the longer you stand there, the more the cold rain begins to seep through your clothes. A shiver coils down your spine as the wind cuts across the drive, urging you forward.\n\nWhatever waits inside can come later... for now, the front porch is the only shelter in sight.",
        "returnDesc": "you're back in the exterior.",
        "choices": {
            "1": {
                "Find Shelter on the Front Porch": "porch",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "porch": {
        "room_code": "POR",
        "description": "The porch groans beneath your weight as you step onto it, the boards swollen and soft from years of damp, each footfall sinking slightly as though the house is testing your presence. The railing is a lacework of peeling paint and rusted nails; its ornate Victorian patterns warped into twisted shapes by time. Up close, the double front doors dominate your vision... tall, heavy slabs of dark wood stained a deep crimson that seems darker in the shadows, almost as if the color had seeped into the grain rather than been painted on. The brass handles are cold beneath a thin film of grime, each one marked by deep gouges, as though someone once clawed at the door in desperation or fury.\n\nOff to your left, partly veiled by a heavy curtain of ivy; a single tall window watches the porch. The glass is clouded with age, its reflection warped, yet you can faintly make out shapes and shadows shifting in the darkness beyond, their edges too soft and distant to understand from here. The wind stirs just enough to rattle a loose porch board behind you, though the rest of the air remains unnervingly still. Ahead, the red doors stand silent and waiting.",
        "returnDesc": "you're back in the porch.",
        "choices": {
            "1": {
                "Enter Scarlet Manor": "foyer",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Investigate the window": "You brush aside a curtain of ivy clinging to the window frame, its brittle leaves crackling as you lean closer. The glass is fogged with age, streaked with dust and darker residue around the edges, but you manage to clear a small smear to peer through. The room beyond is dim and crowded, its walls lined with tall, shadow-soaked shapes that rise almost to the ceiling, and the floor is scattered with fallen objects that catch faint slivers of moonlight... papers, perhaps, or old bindings split from time. A large portrait hangs crooked on the far wall, its features swallowed by darkness, and something about the dense, orderly rows and the cluttered floor makes the space feel heavy, suffocating, meticulously filled. As your eyes adjust, it becomes clear this must be a library... one long neglected. Then the glass thuds softly under your fingertips, as though something inside brushed against it. Your breath fogs the pane, erasing the view, while the ivy beside you rustles once more despite the perfectly still air.",
                "once": true,
                "nav" : false,
                "item": false
            },
            "3": {
                "Turn back": "You glance over your shoulder, back toward the drive where your car waits at the edge of the fog. For a moment, the thought of slipping behind the wheel and leaving this place behind is painfully tempting... just a turn of the key and you could be gone before the house even notices. But the cold air settles heavily around you, and something about the manor's dark silhouette keeps its grip on your attention. You steady your breath, push down the rising urge to flee, and force yourself to turn back toward the house. Whatever waits inside, running won't solve it now. ",
                "once": true,
                "nav" : false,
                "item": false
            }
        }
    },
    "foyer": {
        "room_code": "FOY",
        "description": "You grip the cold brass handle, feeling the deep scratches beneath your fingertips as you pull. The heavy door resists at first, then yields with a long, low groan, releasing a draft of stale, ancient air that spills out around you. As the darkness inside parts just enough to reveal the foyer beyond, you step over the threshold and let the house swallow the sound of the rain behind you.\n\nThe foyer swallows you in cold air the moment you step inside, the scent of dust and old varnish thick enough to taste. Your eyes adjust slowly, shapes taking form in the dim natural light that sneaks past the threshold behind you. The ceiling rises far higher than you expected... an immense, vaulted chamber crowned by a magnificent chandelier suspended low over the open floor. Its iron frame is a sprawling tangle of ornate scrollwork and curved arms, each one fitted with tall, unlit candles. Even in darkness, it radiates a kind of commanding presence, like a relic meant to be adored from below.\n\nYour gaze drifts outward. Twin staircases spiral upward from the left and right sides of the room, their carved banisters mirroring each other perfectly as they curve toward a mezzanine that spans the foyer like a suspended bridge. Straight ahead, beneath that mezzanine, a long hallway stretches into the depths of the house... narrow, dark, lined with doors that seem to lean subtly inward, as though listening. To your immediate right, an open doorway reveals the edge of a parlor draped in heavy curtains, faint shapes of furniture lurking inside. To your left, a large door stands firmly shut... tall and imposing.\n\nYou barely manage a breath before the front door behind you slams shut with violent force, the sound cracking through the chamber like a gunshot. A sharp metallic click follows... locked. In that same heartbeat, the chandelier above erupts to life as every candle ignites at once in a sudden burst of flame. Warm light floods the foyer as sconces along the walls flare open, revealing the house's full grandeur... and the hollow stillness beneath it. Whatever is here, it's not letting you leave anytime soon.",
        "returnDesc": "The foyer greets you with its warm candlelight and towering symmetry, the chandelier still burning steadily overhead. The grand staircases and shadowed hallway seem no less imposing now that you've stood here before.",
        "choices": {
            "1": {
                "Approach the door to the left": "library_door",
                "once": false,
                "nav" : true,
                "item": false
            }, 
            "2": {
                "Investigate the room to the right": "parlor",
                "once": false,
                "nav" : true,
                "item": false
            },
            "3": {
                "Continue straight into the corridor": "hallway",
                "once": false,
                "nav" : true,
                "item": false
            }, 
            "4": {
                "Go up the stairs to the second floor": "mezzanine",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "parlor": {
        "room_code": "PAR",
        "description": "Stepping through the open doorway, you find yourself in a parlor frozen somewhere between elegance and decay. The air is stale, carrying the faint scent of old perfume and dust. A round table commands the center of the room, draped in a faded lace runner and surrounded by mismatched chairs with sunken cushions. On its surface rests a torn page---ripped cleanly from a larger book or diary---with a brass key topped with a rounded, clover-shaped club symbol placed neatly on top, catching the candlelight in a muted glint. Heavy curtains frame tall windows while the warm glow of candles and wall sconces washes over the scattered furnishings: an ornate settee, a pair of armchairs, and a cracked side cabinet leaning slightly under its own weight. The open doorway behind you offers a clear view back into the foyer, reminding you how close you remain to where you first stepped inside.",
        "returnDesc": "The parlor looks much as it did before... the warm candlelight, the sagging furniture, and the round table at the center giving the room its quiet, faded charm. The open doorway still offers a clear view back into the foyer.",
        "choices": {
            "1": {
                "Go back to the foyer": "foyer",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Take the club key": "PAR-T-LBD-01",
                "once": true,
                "nav" : false,
                "item": true
            },
            "3": {
                "Pick up the note": "PAR-N-001-02",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "hallway": {
        "room_code": "HLW",
        "description": "Stepping beneath the mezzanine, you follow the foyer into a long central hallway. To your left, a large wooden sliding door dominates the wall, its handle worn smooth from years of use. To your right, an open doorway leads into what appears to be a dining room, faintly illuminated by the candlelight within.",
        "returnDesc": "The hallway looks much the same as before, with the large sliding door and the open dining room entrance still exactly where you remember them. The faint glow from the foyer lingers nearby, reminding you of the path you came from.",
        "choices": {
            "1": {
                "Open the door on the left": "living_room",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Investigate the dining room": "dining_room",
                "once": false,
                "nav" : true,
                "item": false
            },
            "3": {
                "Go back to the foyer": "foyer",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "living_room": {
        "room_code": "LIV",
        "description": "Sliding open the large wooden door, you find yourself stepping into a living room that feels both lived-in and long forgotten. A wide stone fireplace dominates the far wall, its mantle coated in a thin layer of dust, and a large portrait hangs above it... its softened features watching the room with an unreadable stillness. The candlelight washes warmly over the faded furniture: a sagging sofa with worn stitching, two armchairs whose cushions have long since lost their shape, and a low coffee table settled between them. On the table rests a yellowed newspaper clipping, its brittle edges curled and its ink faded from years of neglect, as though it has waited untouched for longer than anyone can easily guess.",
        "returnDesc": "The living room looks much as you left it; the dusty fireplace, the worn furniture, and the quiet stillness giving the space an unchanged, lingering heaviness.",
        "choices": {
            "1": {
                "Go back into the hallway": "hallway",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Examine the portrait": "The portrait above the fireplace shows a man standing proudly before the freshly carved mouth of a mine, the raw earth behind him marking the earliest days of what would become the Scarlet family legacy. He's dressed in a striking purple suit, its color still vivid despite the painting's age, and his rigid posture suggests a man certain of his own importance. A tarnished bronze nameplate fixed to the ornate frame reads: 'William A. Scarlet --- Scarlet Mine Grand Opening, 1866.' Something about that date lingers in your mind, as though it may matter more than it seems.",
                "once": false,
                "nav" : false,
                "item": false
            },
            "3": {
                "Pick up the newspaper": "LIV-N-003-01",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "dining_room": {
        "room_code": "DIN",
        "description": "Stepping into the dining room, you find a long, imposing table stretching down the center of the room, its surface mostly bare beneath a thin layer of dust. Only the head of the table shows signs of regular use... the chair pushed back slightly, its cushion worn in a way that suggests the same person sat there day after day. Just beside it, another place has been set with deliberate care, yet the untouched dust coating the plate and silverware reveals it hasn't been used in a very long time. The two settings---one lived-in, one frozen in remembrance---cast a quiet, uneasy weight across the room. As you take a step further inside, a sudden scurrying sound draws your eye... a small rat darts across the floor and disappears through a tiny hole in the far wall, vanishing into whatever room lies beyond. On that same wall, a simple wooden door waits slightly ajar, almost certainly leading toward the kitchen.",
        "returnDesc": "The dining room is just as still as before, the long table and dim candlelight giving the space the same quiet, heavy atmosphere.",
        "choices": {
            "1": {
                "Go through the door": "kitchen",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Go back out into the hallway": "hallway",
                "once": false,
                "nav" : true,
                "item": false
            }
        }        
    },
    "kitchen": {
        "room_code": "KIT",
        "description": "Stepping into the kitchen, you're met with the mix of worn tile floors and warm candlelight drifting in from the dining room. An old refrigerator stands against the far wall, its enamel chipped and humming faintly with age. A narrow door hangs slightly ajar, revealing the edge of a pantry beyond, while a heavier exterior door on the opposite wall leads out toward the greenhouse or garden, carrying a faint earthy scent through its cracks. In the center of the room sits a wooden island, and perched atop it is the same rat you saw in the dining room... now staring directly at you. With deliberate intention, it grabs a crumpled piece of paper from the countertop, hops down to the floor, and scurries toward a small hole at the base of the wall. Near the hole's entrance, the tile is smeared with faded streaks of peanut butter and jelly, a clear indication of the creature's favorite meal. Just before vanishing inside, the rat pauses, peeks out at you with the note still in its mouth, and slowly retreats, as if urging you to follow.",
        "returnDesc": "The kitchen feels much the same as before, the worn tiles and old refrigerator giving it a tired stillness. Near the wall, the rat's hole, and the faint smears of peanut butter and jelly remain just as you remember them.",
        "choices": {
            "1": {
                "Investigate the rat's hole": "rat_hole",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Open the fridge": "fridge",
                "once": false,
                "nav" : true,
                "item": false
            },
            "3": {
                "Investigate the pantry": "pantry",
                "once": false,
                "nav" : true,
                "item": false
            },
            "4": {
                "Go out to the greenhouse": "greenhouse",
                "once": false,
                "nav" : true,
                "item": false
            },
            "5": {
                "Go back to the dining room": "dining_room",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "rat_hole": {
        "room_code": "RAT",
        "description": "You crouch beside the small hole in the wall, but the rat is already deep within the shadows, the crumpled note well out of reach. The floor around the entrance is smeared with old peanut butter and jelly, stained into the tiles as if from countless tiny meals. You can't help but think 'if only there were some way to lure the rat back out.'",
        "returnDesc": "You crouch back down to the investigate rat's home.",
        "choices":{
            "1": {
                "Stand back up": "kitchen",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "fridge": {
        "room_code": "FRD",
        "description": "You pull open the refrigerator door, surprised when a faint chill washes over you... the old appliance still humming stubbornly after all these years. Inside, the shelves are nearly bare: several small cups of yogurt lined neatly along one side, and a single jar of grape jelly sitting alone on the top shelf, its label faded but recognizable.",
        "returnDesc": "The refrigerator hums softly as you open it again, its faint cool air drifting out just as before.",
        "choices":{
            "1": {
                "Close the fridge": "kitchen",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Take a yogurt cup": "FRD-T-XXX-01",
                "once": true,
                "nav" : false,
                "item": true
            },
            "3": {
                "Take the jelly": "FRD-T-XXX-02",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "pantry": {
        "room_code": "PAN",
        "description": "Stepping into the pantry, you're met with the stale, musty scent of old wood and decades of dust. The narrow shelves sag slightly under the weight of their forgotten contents, most of it long past its prime. Amid the clutter, a jar of peanut butter sits unopened beside a loaf of bread sealed in a plastic bag that's stiff with age. Stacked beside them---and crammed into nearly every remaining shelf---are countless boxes of macaroni and cheese, piled haphazardly as though someone once stocked them in bulk and never got the chance to go through it all.",
        "returnDesc": "The pantry feels just as you left it: dusty, cramped, and crowded with its forgotten shelves of old mac and cheese.",
        "choices": {
            "1": {
                "Go back into the kitchen": "kitchen",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Take a box of mac and cheese": "PAN-T-XXX-01",
                "once": true,
                "nav" : false,
                "item": true
            },
            "3": {
                "Take the peanut butter": "PAN-T-XXX-02",
                "once": true,
                "nav" : false,
                "item": true
            },
            "4": {
                "Take the loaf of bread": "PAN-T-XXX-03",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "greenhouse": {
        "room_code": "GHS",
        "description": "Stepping into the greenhouse, you're met with a heavy wave of warm, humid air... thick with the scent of damp soil and long-neglected plants. Grimy glass panes arch overhead, filtering the rain into soft, muted streaks of light that fall across several large planter boxes arranged throughout the room. Most of the vegetation has collapsed into brittle stems, leaving dark soil exposed in uneven mounds. In the corner, a crooked utility closet hangs half-open, its interior barely visible.\n\nAs you take another step, a sudden coolness slips across the back of your neck---unnatural in the greenhouse's heat---and the air stirs with a faint rustle of dead leaves. For a moment, you feel as though someone is passing behind you. Then a whisper drifts through the space, soft as breath against glass:\n\n'What's forgotten settles deep... where the oldest roots cling to memory.'\n\nThe sound fades, and the greenhouse returns to stillness... except for one detail you didn't notice before. In the central planter box, the soil forms a slightly raised, uneven patch, its surface subtly smoother than the rest, as though something had once been buried there... and recently covered again.",
        "returnDesc": "The greenhouse stands quiet and still, warm air heavy with the scent of damp soil while rain patters softly against the grimy glass panes above.",
        "choices": {
            "1": {
                "Search the utility closet": "utility_closet",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Go back into the kitchen": "kitchen",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "planter_box": {
        "room_code": "PLB",
        "description": "You press the pristine trowel into the raised patch of soil, its ornate handle fitting comfortably in your grip as the metal slips easily beneath the surface. The dirt parts with surprising softness, as though it's been disturbed not long ago. With a few careful scoops, the trowel strikes something solid... wood, faintly hollow-sounding under the blade. Brushing the soil aside, you reveal a small wooden box, its surface worn smooth and stained dark with age. The lid lifts with a reluctant creak, and inside, nestled against faded cloth, rests a brass key topped with a sharp, gleaming diamond-shaped head. As you loosen your grip on the trowel, it slips from your hand... yet before it touches the floor, it simply vanishes, leaving only the faint, uncanny sense, that it landed somewhere very... very far away.",
        "returnDesc": "",
        "choices": {
            "1": {
                "Take the diamond key": "PLB-T-LBD-02",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "utility_closet": {
        "room_code": "UTC",
        "description": "The interior of the closet is almost entirely bare. The air is stale and musty and the floor and walls are painted in a fine layer of dust. The only furniture of note is a plain wooden table. Perched on that table is a pristine trowel.\n\nThe trowel is your implement. You'll need it if you want to do this right.",
        "returnDesc": "The utility closet remains just as you left it... cluttered with rusted tools.",
        "choices": {
            "1": {
                "Return to the greenhouse": "greenhouse",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Take the trowel": "UTC-T-PTB-01",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "mezzanine": {
        "room_code": "MEZ",
        "description": "Walking up the stairs and stepping out onto the center of the mezzanine, you find yourself looking down over the grand foyer from a new vantage point. The chandelier hangs closer now, its many candles flickering in a delicate, wavering constellation above the open space below. From up here, the sweeping symmetry of the foyer is easier to appreciate... the twin staircases curling gracefully into one another, the tall portrait frames lining the walls, and the heavy front door sitting motionless beneath you. The long hallway stretches out behind you, running east to west with four closed doors set evenly along the northern wall, each one distinct in its own quiet way.\n\nThe left-most door is broad and sturdier than the others, its frame subtly more ornate... as if someone of importance once slept beyond it. The second door has a faint, lingering scent of dust and fabric drifting from its seams. The third door carries the slightest echo of tile beneath it, a coolness you can feel even from here. And the fourth door, though plain, seems to hum faintly with the restless stillness of a room that hasn't been opened in years.\n\nA glance upward reveals another detail: centered above the mezzanine ceiling is a closed drop-down attic ladder, its wooden frame tightly shut and far out of reach. The sight of it sends a mild shiver down the back of your neck... a reminder that, even here, the house has spaces not yet willing to meet you.",
        "returnDesc": "The mezzanine feels just as you left it, offering a clear view of the grand foyer below and the soft glow of the chandelier drifting upward in warm, steady light.",
        "choices": {
            "1": {
                "Go through door number 1": "master_bedroom",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Go through door number 2": "kids_room",
                "once": false,
                "nav" : true,
                "item": false
            },
            "3": {
                "Go through door number 3": "bathroom",
                "once": false,
                "nav" : true,
                "item": false
            },
            "4": {
                "Go through door number 4": "spare_room",
                "once": false,
                "nav" : true,
                "item": false
            },
            "5": {
                "Go down the stairs to the foyer": "foyer",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "bathroom": {
        "room_code": "BTH",
        "description": "Stepping through the door into a bathroom, you're met with the cool scent of tile and old porcelain, the candlelight reflecting off the glossy surfaces in soft, uneven patches. The room itself is tidy but long unused... dust clinging to the corners of the mirror and faint mineral stains shadowing the edges of the sink. On the countertop sits a peculiar ring stand shaped like an open hand, each of its five sculpted fingers meant to hold a ring. Four of them are adorned with tarnished bands, but the center finger stands bare, as though something important once rested there. The stand's base is unusually large and heavy, carved with faint decorative grooves, and it appears to conceal a small drawer... yet no latch, handle, or seam offers any hint on how it might be opened. The stillness of the room makes the absence of the missing ring feel strangely deliberate.",
        "returnDesc": "The bathroom is just as quiet as before, its cool tiles and faintly dusty fixtures reflecting the soft candlelight in muted patches.",
        "choices": {
            "1": {
                "Leave the bathroom": "mezzanine",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "kids_room": {
        "room_code": "KID",
        "description": "Stepping through the door into a bedroom, you're met with a gentle hush, as though the room has been frozen in the moment it was last occupied. Faded floral wallpaper curls softly at the edges, and a small wooden desk sits beneath the window, still scattered with remnants of a life once lived here... an old journal with brittle pages, a dried fountain pen, and a cracked ceramic trinket that looks like it once held sentimental value. Beside the neatly made bed, a small table holds an unframed photograph, its edges worn from years of handling. Along one wall, a narrow bookshelf leans under the weight of well-loved novels and framed pictures capturing a younger woman in various candid moments: laughing with friends, posing in the manor's garden, and standing beside an older man whose expression is both proud and distant. The whole room feels paused mid-step, as though whoever lived here left quickly and never looked back.",
        "returnDesc": "The room is just as you left it... quiet, still, and filled with the lingering traces of life.",
        "choices": {
            "1": {
                "Open the closet door": "kids_closet",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Leave the bedroom": "mezzanine",
                "once": false,
                "nav" : true,
                "item": false
            },
            "3": {
                "Pick up the photo": "KID-T-XXX-01",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "kids_closet": {
        "room_code": "KDC",
        "description": "You pull open the closet door, and it resists at first... something inside shifting with a soft scrape before giving way. The space beyond is cramped and cluttered, piles of old belongings heaped in the center as though everything was hastily shoved inside in a single desperate moment. Boxes, folded blankets, brittle papers, and forgotten trinkets form an unstable mound that nearly reaches your waist. At the very top of it all sits a Victorian porcelain doll, its cracked face turned directly toward the door as if patiently waiting for someone to finally open it. The dim candlelight glints off its glassy eyes, making the stillness feel suddenly, unmistakably aware.",
        "returnDesc": "You open the doors to the closet again",
        "choices": {
            "1": {
                "Close the closet doors": "kids_room",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Take the doll": "KDC-T-XXX-01",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "spare_room": {
        "room_code": "SPR",
        "description": "Stepping through the door into a bedroom, you're greeted by the heavy scent of dust and long neglect. Sheets of yellowed tarp drape over every piece of furniture... dressers, chairs, even the bed... each one sagging under the weight of decades of undisturbed grime. The room feels hollow, abandoned long before the rest of the house began to fade, its stillness almost oppressive. Near the far wall, propped against a covered dresser, stands the only object not hidden beneath a tarp: a simple wooden broom, its handle worn smooth and its bristles stiff with age, as though waiting for a purpose long forgotten.",
        "returnDesc": "The spare bedroom looks unchanged... quiet, dust-heavy, and filled with the same tarped furniture standing untouched beneath its long-settled stillness.",
        "choices": {
            "1": {
                "Leave the spare bedroom": "mezzanine",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Take the wooden broom": "SPR-T-MEZ-01",
                "once": true,
                "nav" : false,
                "item": true
            }
        }
    },
    "master_bedroom": {
        "room_code": "MBR",
        "description": "You step into the large bedroom, and it doesn't take long to realize this must have been the master bedroom. A heavy quiet hangs in the air, thicker than the dust settling along the floorboards. The space is broad and well-appointed, its furniture grand but worn... an ornate dresser with dulled brass handles, a vanity whose mirror has lost its clarity, and a tall wardrobe standing sentinel in the corner. On one side of the room, a large glass door leads out onto a narrow balcony, its panes fogged with age but still offering a muted glimpse of the manor grounds. Beside the wardrobe, another door stands slightly ajar, revealing the faint tiled glimmer of a private bathroom.\n\nAt the center of the room rests a wide, elegant bed, its quilt neatly made except for one telling detail: the left side is creased and indented, as though someone slept there night after night, while the right side remains perfectly smooth, untouched for far longer than the other. As you step closer, you notice a small safe tucked beneath the well-worn side of the bed, its metal surface faintly scuffed but solid. The air carries a lingering trace of old cologne and something more difficult to place... an echo of someone who stayed here long after the rest of the house fell silent.",
        "returnDesc": "The bedroom feels much the same as before... quiet, spacious, and marked by the uneven use of the bed, the balcony door and private bathroom still exactly where you remember them.",
        "choices": {
            "1": {
                "Leave the master bedroom": "mezzanine",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Investigate the balcony": "balcony",
                "once": false,
                "nav" : true,
                "item": false
            },
            "3": {
                "Investigate the bathroom": "master_bathroom",
                "once": false,
                "nav" : true,
                "item": false
            },
            "4": {
                "Approach the safe": "master_safe",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "master_safe": {
        "room_code": "SFE",
        "description": "You kneel beside the safe tucked beneath the worn side of the bed, the metal cool beneath your hand and marked with faint scuffs from years of quiet use. The combination dial turns with a soft, deliberate click, each number falling into place as if waiting for the correct touch. As you study the face of it, a chill curls through the air behind you... subtle, but unmistakably present. A whisper follows, drifting past your ear like a faint echo through the walls:\n\n'Their legacy began on the day they first broke the earth...'\n\nThe sound fades instantly, leaving only the quiet hum of the room and the steady weight of the safe before you. Whatever code it requires, it's bound to the family's beginnings... and to a date already recorded somewhere within these walls.",
        "returnDesc": "The safe sits silently beneath the bed, its cold metal surface and waiting combination dial just as you left them.",
        "choices": {
            "1": {
                "Open the safe": "open_safe",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Stand back up": "master_bedroom",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "open_safe": {
        "room_code": "OPS",
        "description": "",
        "returnDesc": "",
        "choices": {}
    },
    "master_bathroom": {
        "room_code": "MBA",
        "description": "Stepping into the master bathroom, you're immediately struck by the stark contrast along the dual-sink countertop. One side is crowded with forgotten makeup items---powder compacts, lipstick tubes, brushes---all coated in a thick layer of dust that suggests they haven't been touched in decades. The other sink is much simpler, holding only a lone toothbrush and an old tube of toothpaste, as though someone here lived with the barest necessities. The mirror above them is clouded and speckled, reflecting the quiet divide between these two long-abandoned routines.",
        "returnDesc": "The master bathroom feels unchanged, its quiet contrast between the two sinks still lingering beneath the dim, clouded mirror.",
        "choices": {
            "1": {
                "Leave the bathroom": "master_bedroom",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "balcony": {
        "room_code": "BAL",
        "description": "Stepping out onto the narrow balcony, you're greeted by the cool rush of night air and the steady patter of rain against the iron railing. Below, the grounds stretch out in dark, rippling shapes... the overgrown gardens, the distant tree line, and the faint glimmer of the long drive winding back toward the world you left behind. Beyond it all, the surrounding mountains rise like great shadowed sentinels, their peaks fading into the clouds as the storm drapes them in mist. The moon hangs low behind shifting veils of gray, its pale light slipping through just enough to silver the rain, turning each droplet into a brief, shimmering bead before it vanishes into the darkness. The sound of the rainfall, the vast sweep of the land, and the looming silhouettes of the mountains lend the night an uncanny beauty... calm, immense, and quietly watchful.",
        "returnDesc": "The balcony feels much the same... a cool sweep of night air, rain tapping against the iron railing, and the dark silhouettes of the mountains watching from afar.",
        "choices": {
            "1": {
                "Go back inside": "master_bedroom",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "attic": {
        "room_code": "ATC",
        "description": "You climb the ladder into the attic, pulling yourself up into a dim, dust-filled space that smells faintly of old paper and insulation. Rows of filing cabinets stretch along the walls, their drawers packed tight with documents that haven't seen daylight in decades. Boxes of every size are stacked in precarious towers, some leaning at uneasy angles as though the slightest disturbance might send them toppling. As you take your first careful steps forward, one of the stacks shudders, then collapses with a soft crash... papers rustling as they spill across the floor. Amid the scattered mess, a single document slides out from the chaos and comes to rest neatly at your feet, as if choosing to be found.",
        "returnDesc": "The attic remains cluttered and still, the towers of boxes and old filing cabinets standing in their dusty, overstuffed silence.",
        "choices": {
            "1": {
                "Go back down the ladder onto the mezzanine": "mezzanine",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Pick up the document": "ATC-N-005-01",
                "once": true,
                "nav" : false,
                "item": true
            }
        }

    },
    "library_door": {
        "room_code": "LBD",
        "description": "You move toward the tall, imposing door that stands shut along the foyer wall, its presence far heavier than you first realized. Up close, the wood reveals itself to be thick and tightly grained, reinforced with iron bands that run across its surface like ribs. Heavy chains have been drawn over the door in a tight lattice, secured by three distinct brass padlocks, each shaped like a card suit... one a pointed spade, another a rounded club, and the last a sharp-edged diamond. The locks hang motionless in the candlelight, giving the unmistakable impression that whatever lies beyond this door was meant to remain sealed.",
        "returnDesc" : "The tall, imposing door stands just as before, its heavy frame looming silently along the foyer wall.",
        "choices": {
            "1": {
                "Turn back into the foyer" : "foyer",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "library": {
        "room_code": "LIB",
        "description": "Stepping into the library, you're immediately struck by the sheer vertical space... the ceiling rises far above you, disappearing into shadowed beams that make the room feel almost cathedral-like. Tall shelves stretch up the walls on either side, packed with aging books whose spines fade from deep reds to brittle browns. Between the shelves stand six pilasters---three on each side---each one crowned with a framed portrait of an old Scarlet family member. Their painted eyes watch the room with a solemn, almost judging stillness. Beneath each portrait, a small wall-mounted candle glows softly, the flames trembling just enough to make the faces above them seem to shift in the unsteady light.\n\nThe air carries the scent of old paper and cold stone, a quiet weight pressing in from all sides. Directly across from where you entered, another door breaks the far wall, its frame dark and unadorned, standing in stark contrast to the grandeur around it. For a moment, you feel as though you've stepped not just into a room, but into the collected memory of the Scarlet line... one that has been waiting, patiently, for someone to disturb its silence.",
        "returnDesc" : "Stepping back into the library, you find the tall shelves and solemn pilasters just as before, their candlelit portraits watching in steady, unblinking silence. The vastness of the room feels no less heavy this time around.",
        "choices": {
            "1": {
                "Go through the other door" : "study",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Go back out into the foyer": "foyer",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "study": {
        "room_code": "STD",
        "description": "You push open the door and step into what reveals itself to be a study... though 'overwhelmed workspace' might suit it better. The room is a whirlwind of clutter: books stacked in teetering piles, papers strewn over chairs, folders left half-open as though abandoned mid-thought. The air carries the stale scent of ink and old parchment, thick enough to feel like residue on your fingertips. At the center sits a broad wooden desk nearly swallowed by the chaos, and among the mess lies a single sheet placed prominently on top... its surface filled with frantic, looping scribbles that look intent but ultimately meaningless. Against the right wall stands a tall, plain mirror with an unusually thin frame, devoid of decoration or charm. The longer you look at it, the more it feels like it doesn't quite belong to the room---or maybe even the house---at all.",
        "returnDesc" : "",
        "choices": {
            "1": {
                "Read the note on the desk" : "I heard her again last night.\n\n\n\nThe footsteps in the west hall... soft, deliberate... exactly the way she used to walk when she didn't want to wake me. I tried to tell myself it was the house settling, but the boards creaked in the same rhythm they always did beneath her feet.\n\nI haven't stepped past the front stoop in weeks. Every time I get close, I see her silhouette in the doorway behind me. I turn, and of course nothing is there. Nothing ever is. But I can feel her. Sometimes I smell her perfume. Sometimes I hear her humming that lullaby she used to sing when she was nervous.\n\n\n\nShe wants me here.\n\nShe wants me to stay.\n\nOr she wants me to remember.\n\n\n\nI don't sleep anymore. When I close my eyes I see the shaft collapsing again, hear the screams, hear her voice above them all... accusing, pleading, echoing off the stone. I used to believe guilt was a weight a man carried inside. But this house carries it too. The walls remember. She remembers.\n\nI've thought about leaving. God knows I've tried. But every time I reach for the door, my hand shakes so violently I can't touch the knob. I know what waits for me outside. Judgment. Discovery. Her.\n\nAt least here, within these walls, I can pretend she's only a memory.\n\nA man can convince himself of many things, given enough silence.\n\nBut this house is never silent.\n\n\n\nNot anymore.",
                "once": true,
                "nav" : false,
                "item": false
            },
            "2": {
                "Return to the library" : "puzzle_library",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "puzzle_library": {
        "room_code": "LIP",
        "description": "You step out of the study and back into the library, the tall ceiling and rows of pilasters rising around you like a silent cathedral. As you lift your gaze, a figure hovers in the open air above... Eleanor. Her form drifts weightlessly, her features soft and distant, yet her eyes meet yours with a sharp, unmistakable awareness. She doesn't speak. Instead, her expression tightens with a kind of mournful urgency before her outline thins, dissolving into the air like mist caught in a draft.\n\nThe silence that follows lasts only a heartbeat.\n\nA violent crash erupts from beyond the doorway. The chandelier in the foyer plummets from the ceiling, hitting the floor with explosive force as flames burst outward in a sweeping ring. Fire races across the foyer in an instant, swallowing the walls in a roar of heat and smoke. Before you can react, the library door slams shut, the lock clacking shut with sharp finality.\n\nEleanor's voice glides through the library... not spoken aloud, but pressed into the air around you, old and aching with purpose:\n\n'Let the tale be told as it was lived...'\n\nAt her words, the candles mounted beneath each portrait flare into sudden blue flame, the unnatural fire licking upward. The canvases ignite without heat, burning away in eerie silence until new images emerge beneath the ash... different scenes, different faces, as though the paintings themselves have shed false histories to reveal what truly happened.\n\nThe room settles into a charged, waiting stillness. The story, it seems, is now yours to uncover.",
        "returnDesc" : "You step back toward the center of the library, leaving the pilaster behind. From here, the room's vast height and the silent, altered portraits seem to draw in around you again, the space settling into a watchful stillness as though waiting for your next move.",
        "choices": {
            "1": {
                "Investigate pilaster number 1" : "pilaster_1",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Investigate pilaster number 2" : "pilaster_2",
                "once": false,
                "nav" : true,
                "item": false
            },
            "3": {
                "Investigate pilaster number 3" : "pilaster_3",
                "once": false,
                "nav" : true,
                "item": false
            },
            "4": {
                "Investigate pilaster number 4" : "pilaster_4",
                "once": false,
                "nav" : true,
                "item": false
            },
            "5": {
                "Investigate pilaster number 5" : "pilaster_5",
                "once": false,
                "nav" : true,
                "item": false
            },
            "6": {
                "Investigate pilaster number 6" : "pilaster_6",
                "once": false,
                "nav" : true,
                "item": false
            }
        }
    },
    "pilaster_1": {
        "room_code": "PL1",
        "description": "The portrait depicts an imposing Scarlet patriarch standing behind a broad, mahogany desk. His posture is rigid, almost statuesque, with his hands clasped lightly in front of him as though caught mid-thought... or mid-sentence he chose not to speak. His expression is unreadable: neither stern nor kind, simply closed, sealed off like a vault.\n\nBehind him, a heavy crimson curtain hangs in thick folds, drawn partially across a tall window. Enough light slips around the fabric to suggest a world beyond, but the curtain refuses to reveal it fully. The shrouded window casts a long shadow over the patriarch's shoulder, darkening half his figure as if hiding something best left unspoken.\n\nOn the desk beside him rests a small brass scale, delicately crafted but noticeably off-balance, one dish hanging lower than the other. It is the only object in the scene tilted, imperfect, intruding upon the otherwise meticulous composition.\n\nEverything about the painting feels intentional. Controlled.\n\nA portrait of a man who knew exactly what not to say.",
        "returnDesc" : "The portrait depicts an imposing Scarlet patriarch standing behind a broad, mahogany desk. His posture is rigid, almost statuesque, with his hands clasped lightly in front of him as though caught mid-thought... or mid-sentence he chose not to speak. His expression is unreadable: neither stern nor kind, simply closed, sealed off like a vault.\n\nBehind him, a heavy crimson curtain hangs in thick folds, drawn partially across a tall window. Enough light slips around the fabric to suggest a world beyond, but the curtain refuses to reveal it fully. The shrouded window casts a long shadow over the patriarch's shoulder, darkening half his figure as if hiding something best left unspoken.\n\nOn the desk beside him rests a small brass scale, delicately crafted but noticeably off-balance, one dish hanging lower than the other. It is the only object in the scene tilted, imperfect, intruding upon the otherwise meticulous composition.\n\nEverything about the painting feels intentional. Controlled.\n\nA portrait of a man who knew exactly what not to say.",
        "choices": {
            "1": {
                "Return" : "puzzle_library",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Exstinguish the candle's flame" : "You extinguish the candle's flame on pilaster 1.",
                "once": true,
                "nav" : false,
                "item": false
            }
        }
    },
    "pilaster_2": {
        "room_code": "PL2",
        "description": "The portrait captures a Scarlet woman standing beside a tall, mullioned window, her figure wrapped in soft afternoon light. She rests one hand gently against the glass, fingers splayed as though reaching toward something beyond the pane... or bracing herself from it. Outside, the distant hillside and tree line appear calm enough to be a painting within a painting, serene and untouched.\n\nHer face, though composed, carries a quiet tension. Her eyes are fixed on a point far beyond the viewer's sight, wide enough to suggest worry she does not speak aloud. There is a subtle furrow in her brow, the kind that forms only after many days of unrest.\n\nThe reflection in the glass is the most unsettling detail: it is ever so slightly misaligned with her true position, as if the painted reflection were delayed, or looking somewhere else entirely. It gives the impression that the woman sees a truth even her mirrored self cannot bear.\n\nBehind her, the rest of the parlor is warm and orderly... lace curtains, a tidy writing desk, an oil lamp resting unused. Everything in the room is calm, but she is not.\n\nA figure who sensed disaster long before anyone else dared admit it.",
        "returnDesc" : "The portrait captures a Scarlet woman standing beside a tall, mullioned window, her figure wrapped in soft afternoon light. She rests one hand gently against the glass, fingers splayed as though reaching toward something beyond the pane... or bracing herself from it. Outside, the distant hillside and tree line appear calm enough to be a painting within a painting, serene and untouched.\n\nHer face, though composed, carries a quiet tension. Her eyes are fixed on a point far beyond the viewer's sight, wide enough to suggest worry she does not speak aloud. There is a subtle furrow in her brow, the kind that forms only after many days of unrest.\n\nThe reflection in the glass is the most unsettling detail: it is ever so slightly misaligned with her true position, as if the painted reflection were delayed, or looking somewhere else entirely. It gives the impression that the woman sees a truth even her mirrored self cannot bear.\n\nBehind her, the rest of the parlor is warm and orderly... lace curtains, a tidy writing desk, an oil lamp resting unused. Everything in the room is calm, but she is not.\n\nA figure who sensed disaster long before anyone else dared admit it.",
        "choices": {
            "1": {
                "Return" : "puzzle_library",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Exstinguish the candle's flame" : "You extinguish the candle's flame on pilaster 2.",
                "once": true,
                "nav" : false,
                "item": false
            }
        }
    },
    "pilaster_3": {
        "room_code": "PL3",
        "description": "The portrait depicts a Scarlet woman seated at a modest writing desk, her posture slightly hunched, as though the weight of her thoughts has drawn her inward. A sheet of cream-colored stationery lies before her, the first few lines written in a graceful hand before trailing off into nothing. Her pen hovers above the page, poised but unmoving, caught in the silent hesitation of words too painful to commit to ink.\n\nThe candle beside her burns low, its flame flickering toward exhaustion. Melted wax spills unevenly down its base, pooling in soft white folds that resemble fallen tears. Shadows gather around the edges of the room, leaving her face illuminated yet lonely... revealing the quiet anguish in her eyes, the tight pull of her lips trying not to tremble.\n\nAt the far corner of the desk sits a small framed photograph of a teenage girl. The frame is turned slightly away from the woman, as if she had rotated it mid-thought, uncertain whether to face it or hide it. The girl's expression is bright, hopeful... the kind of smile that suggests she has already chosen her path, even if it means stepping away from everything she once called home.\n\nThe painting holds its breath, preserving the moment just before a mother puts pen to paper and decides what truths she can bear to send, and which she must carry alone.",
        "returnDesc" : "The portrait depicts a Scarlet woman seated at a modest writing desk, her posture slightly hunched, as though the weight of her thoughts has drawn her inward. A sheet of cream-colored stationery lies before her, the first few lines written in a graceful hand before trailing off into nothing. Her pen hovers above the page, poised but unmoving, caught in the silent hesitation of words too painful to commit to ink.\n\nThe candle beside her burns low, its flame flickering toward exhaustion. Melted wax spills unevenly down its base, pooling in soft white folds that resemble fallen tears. Shadows gather around the edges of the room, leaving her face illuminated yet lonely... revealing the quiet anguish in her eyes, the tight pull of her lips trying not to tremble.\n\nAt the far corner of the desk sits a small framed photograph of a teenage girl. The frame is turned slightly away from the woman, as if she had rotated it mid-thought, uncertain whether to face it or hide it. The girl's expression is bright, hopeful... the kind of smile that suggests she has already chosen her path, even if it means stepping away from everything she once called home.\n\nThe painting holds its breath, preserving the moment just before a mother puts pen to paper and decides what truths she can bear to send, and which she must carry alone.",
        "choices": {
            "1": {
                "Return" : "puzzle_library",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Exstinguish the candle's flame" : "You extinguish the candle's flame on pilaster 3.",
                "once": true,
                "nav" : false,
                "item": false
            }
        }
    },
    "pilaster_4": {
        "room_code": "PL4",
        "description": "The portrait presents a distinguished Scarlet patriarch seated at a grand mahogany desk, the kind built to convey authority but currently doing little to steady the man behind it. He sits rigidly, shoulders tight, one hand gripping the carved armrest with such force that his knuckles blanch to a stark, unnatural white. His other hand rests atop a closed journal, fingers curled possessively as though afraid someone might take it from him... or read what lies inside.\n\nA single desk lamp casts a narrow cone of light across his face, illuminating deep lines etched into his brow and around his eyes. Those eyes, wide and rimmed with fatigue, do not meet the viewer's gaze but stare slightly past it, fixed on something beyond the frame. Something only he can see.\n\nBehind him, the rest of the study is swallowed in shadow, but a glass-fronted cabinet catches enough light to reflect the room. At first glance, the cabinet's reflection appears ordinary. But on closer inspection, a faint, blurred silhouette stands just behind the man's chair... indistinct yet unmistakably human, its shape leaning forward as if whispering into his ear.\n\nThe subject in the painting gives no indication he notices it.\n\nOr perhaps he notices it far too well.\n\nEvery detail in the work---the tense hands, the hollowed eyes, the ghostlike form in the reflection---paints the story of a man consumed not by illness or age, but by something he can never outrun inside his own home.",
        "returnDesc" : "The portrait presents a distinguished Scarlet patriarch seated at a grand mahogany desk, the kind built to convey authority but currently doing little to steady the man behind it. He sits rigidly, shoulders tight, one hand gripping the carved armrest with such force that his knuckles blanch to a stark, unnatural white. His other hand rests atop a closed journal, fingers curled possessively as though afraid someone might take it from him... or read what lies inside.\n\nA single desk lamp casts a narrow cone of light across his face, illuminating deep lines etched into his brow and around his eyes. Those eyes, wide and rimmed with fatigue, do not meet the viewer's gaze but stare slightly past it, fixed on something beyond the frame. Something only he can see.\n\nBehind him, the rest of the study is swallowed in shadow, but a glass-fronted cabinet catches enough light to reflect the room. At first glance, the cabinet's reflection appears ordinary. But on closer inspection, a faint, blurred silhouette stands just behind the man's chair... indistinct yet unmistakably human, its shape leaning forward as if whispering into his ear.\n\nThe subject in the painting gives no indication he notices it.\n\nOr perhaps he notices it far too well.\n\nEvery detail in the work---the tense hands, the hollowed eyes, the ghostlike form in the reflection---paints the story of a man consumed not by illness or age, but by something he can never outrun inside his own home.",
        "choices": {
            "1": {
                "Return" : "puzzle_library",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Exstinguish the candle's flame" : "You extinguish the candle's flame on pilaster 4.",
                "once": true,
                "nav" : false,
                "item": false
            }
        }
    },
    "pilaster_5": {
        "room_code": "PL5",
        "description": "The portrait captures a Scarlet patriarch standing upon a narrow iron balcony that overlooks a sprawling mining yard below. He is painted in immaculate detail: sharp suit, polished boots, a gloved hand resting on the railing as though he were surveying a kingdom rather than a workplace. His face holds a look of measured calculation... neither cruel nor kind, simply distant, as if his concerns lie far above the people laboring beneath him.\n\nBelow the balcony, the mine yard stretches outward in muted tones. Dozens of workers move across the scene, but they are rendered with noticeably less clarity than the central figure. Their faces blur into indistinct shapes, their features swallowed by dust and shadow. The machinery around them looms heavy and rust-colored, dominating the landscape and dwarfing the men who operate it.\n\nThe contrast is striking:\n\nThe overseer, crisp and defined, occupies nearly a third of the canvas, while the laborers form a hazy backdrop... more texture than individuals.\n\nA plume of smoke rises from one of the distant shafts, curling upward into the sky. Not enough to alarm, just enough to hint at strain beneath the surface.\n\nNothing in the painting is overtly sinister, yet something about the distance between the overseer and his workers feels unsettling. A man watching not people, but productivity. Not lives, but numbers.\n\nA portrait of authority turned cold.",
        "returnDesc" : "The portrait captures a Scarlet patriarch standing upon a narrow iron balcony that overlooks a sprawling mining yard below. He is painted in immaculate detail: sharp suit, polished boots, a gloved hand resting on the railing as though he were surveying a kingdom rather than a workplace. His face holds a look of measured calculation... neither cruel nor kind, simply distant, as if his concerns lie far above the people laboring beneath him.\n\nBelow the balcony, the mine yard stretches outward in muted tones. Dozens of workers move across the scene, but they are rendered with noticeably less clarity than the central figure. Their faces blur into indistinct shapes, their features swallowed by dust and shadow. The machinery around them looms heavy and rust-colored, dominating the landscape and dwarfing the men who operate it.\n\nThe contrast is striking:\n\nThe overseer, crisp and defined, occupies nearly a third of the canvas, while the laborers form a hazy backdrop... more texture than individuals.\n\nA plume of smoke rises from one of the distant shafts, curling upward into the sky. Not enough to alarm, just enough to hint at strain beneath the surface.\n\nNothing in the painting is overtly sinister, yet something about the distance between the overseer and his workers feels unsettling. A man watching not people, but productivity. Not lives, but numbers.\n\nA portrait of authority turned cold.",
        "choices": {
            "1": {
                "Return" : "puzzle_library",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Exstinguish the candle's flame" : "You extinguish the candle's flame on pilaster 5.",
                "once": true,
                "nav" : false,
                "item": false
            }
        }
    },
    "pilaster_6": {
        "room_code": "PL6",
        "description": "The painting depicts the Scarlet mine entrance in the aftermath of a devastating collapse, rendered in somber earth tones that seem unable to hold any trace of daylight. The once-sturdy support beams now jut out at crooked angles, snapped like brittle bones. Rubble spills from the mouth of the shaft in uneven heaps, forming a dark, choking mound that blocks the tunnel completely. A thin haze of dust still hangs in the air, softening the edges of everything it touches, as though the scene itself is struggling to settle.\n\nIn the foreground, a lone miner;s helmet lies on its side atop the dirt... its cracked surface catching a sliver of muted light. It is the only object in the painting depicted with crisp detail, as if the artist wanted to ensure the viewer could not look away from it. The emptiness of the helmet suggests a story the canvas refuses to state aloud.\n\nBehind it, a small group of figures stands gathered at a distance. They are rendered in faded silhouettes, blurred as though seen through a veil. Their posture speaks for them: heads bowed, shoulders slumped, bodies leaning into one another under a shared weight of grief. None of the figures face the viewer; all eyes are fixed on the collapsed tunnel, on the grave it became in an instant.\n\nThe hillside beyond is dim and colorless, its contours swallowed by the lingering dust cloud. Even the sky above has dulled, streaked with gray, as if nature itself mourns alongside the gathered families.\n\nIt is a quiet painting---still, heavy, and suffocating---capturing the moment when the Scarlet legacy shifted from prosperity to tragedy, long before the world knew just how much was being hidden beneath the rubble.",
        "returnDesc" : "The painting depicts the Scarlet mine entrance in the aftermath of a devastating collapse, rendered in somber earth tones that seem unable to hold any trace of daylight. The once-sturdy support beams now jut out at crooked angles, snapped like brittle bones. Rubble spills from the mouth of the shaft in uneven heaps, forming a dark, choking mound that blocks the tunnel completely. A thin haze of dust still hangs in the air, softening the edges of everything it touches, as though the scene itself is struggling to settle.\n\nIn the foreground, a lone miner;s helmet lies on its side atop the dirt... its cracked surface catching a sliver of muted light. It is the only object in the painting depicted with crisp detail, as if the artist wanted to ensure the viewer could not look away from it. The emptiness of the helmet suggests a story the canvas refuses to state aloud.\n\nBehind it, a small group of figures stands gathered at a distance. They are rendered in faded silhouettes, blurred as though seen through a veil. Their posture speaks for them: heads bowed, shoulders slumped, bodies leaning into one another under a shared weight of grief. None of the figures face the viewer; all eyes are fixed on the collapsed tunnel, on the grave it became in an instant.\n\nThe hillside beyond is dim and colorless, its contours swallowed by the lingering dust cloud. Even the sky above has dulled, streaked with gray, as if nature itself mourns alongside the gathered families.\n\nIt is a quiet painting---still, heavy, and suffocating---capturing the moment when the Scarlet legacy shifted from prosperity to tragedy, long before the world knew just how much was being hidden beneath the rubble.",
        "choices": {
            "1": {
                "Return" : "puzzle_library",
                "once": false,
                "nav" : true,
                "item": false
            },
            "2": {
                "Exstinguish the candle's flame" : "You extinguish the candle's flame on pilaster 6.",
                "once": true,
                "nav" : false,
                "item": false
            }
        }
    }
}